<template>
  <div>
    <h1 class="content__theme-title">Оптимизация приложения с Сomputed</h1>
    <br />

    <h4 style="line-height: 20px">
      Преимущества Computed: <br /><br />
      - Если в шаблон выводится результат вычислений какого-либо метода, данный метод будет вызван при любом изменении данных (при любом событии,
      изменяющем данные шаблона) <br />
      - При использовании Computed свойств оно будет вызвано только если изменились данные, которые участвуют в формировании результата <br />
      - Поэтому при выводе в шаблон результатов каких-либо рассчетов нужно пользоваться Computed свойствами <br />
    </h4>
    <br /><br />

    <h3>Компонент: AppComputed.vue</h3>
    <br />

    <h4>
      Задача: <br />
      - Реализовать счетчик, который выводит значение свойства данных <br />
      - При клике по кнопке "Увеличить счетчик 1" увеличить значение счетчика на 1 <br />
      - При клике по кнопке "Уменьшить счетчик 1" уменьшить значение счетчика на 1 <br />
      - В параграфе вывести следующий текст: <br />
      - Если значение счетчика 1 больше 3 "Значение больше 3" <br />
      - Если значение счетчика 1 меньше 3 "Значение меньше 3" <br />
      - Добавить второй счетчик и третью кнопку, которая увеличивает значение второго счетчика <br />
      - При клике по кнопке "Увеличить счетчик 2" увеличить значение счетчика 2 <br />
      - При этом метод расчета значения счетчика 1 (больше или мешьше 3) не должен вызываться <br />
    </h4>
    <br />

    <h2>Счетчик: {{ counter1 }} / {{ counter2 }}</h2>
    <br />

    <h4>Здесь вывести текст: {{ textValue }}</h4>
    <br />

    <button @click="counter1++" class="button">Увеличить счетчик 1</button>
    <button @click="counter1--" class="button">Уменьшить счетчик 1</button>
    <button @click="counter2++" class="button">Увеличить счетчик 2</button><br /><br />
  </div>
</template>

<script>
export default {
  name: 'app-computed',
  data() {
    return {
      counter1: 0,
      counter2: 0,
    };
  },
  computed: {
    textValue() {
      console.log('Метод вызван');
      return this.counter1 > 3 ? 'Значение больше 3' : 'Значение меньше 3';
    },
  },
};
</script>

<style scoped>
.button {
  margin-right: 8px;
  padding: 4px 8px;
  cursor: pointer;
}
</style>
